Revit 2027 API
FailureMessageAccessor.CloneFailureMessage Method
 Creates a copy of the FailureMessage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureMessage CloneFailureMessage()
Public Function CloneFailureMessage As FailureMessage
public:
FailureMessage^ CloneFailureMessage()
member CloneFailureMessage : unit -> FailureMessage
Return Value
FailureMessage
 Copy of the FailureMesassge.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace